Repository: 84000/data-translation-memory
Catalog: toh72-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཁྱིམ་བདག་དཔས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of the Householder Vīradatta

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ།
en: The Blessed One was staying in Prince Jeta’s Grove, Anāthapiṇḍada’s pleasure garden, in Śrāvastī together with a great monastic assembly of 1,250 monks. All were arhats whose contaminants had been exhausted.

source: ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were free from defilements and had attained mastery.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ།
en: Their minds were completely free, and their insight perfectly liberated.

source: གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were well-born great elephants, successful and accomplished.

source: ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burdens and fulfilled their aims.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ། ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They had eliminated the fetters of existence, and their minds were completely liberated through perfect knowledge.

source: སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་དུ་སེམས་པ། མངོན་པར་ཤེས་པས་མངོན་པར་ཤེས་པ་ཤ་སྟག་སྟེ།
en: They had attained supreme perfection in mastering all mental states.

source: གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའོ།
en: Indeed, they were all this way—with the exception of one person, Venerable Ānanda.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ཐམས་ཅད་ཀྱང་གཟུངས་ཐོབ་པ། ཏིང་ངེ་འཛིན་ཐོབ་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: They were accompanied by five hundred bodhisattvas, all of whom had attained retention and meditative absorption.

source: དེའི་ཚེ་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་ན་ཁྱིམ་བདག་དཔས་བྱིན་ཞེས་བྱ་བ་ཕྱུག་པ། ནོར་ཆེ་བ། བདག་དབང་བ་མང་བ། ནོར་དང་ཡོ་བྱད་མང་བ། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བའི་ཚོགས་མང་བ།
en: At that time, in the great city of Śrāvastī there was a householder named Vīradatta who had immense wealth, extensive assets, abundant capital and provisions, and multiple storehouses and treasuries of jewels and grain.

source: གླང་པོ་ཆེ་དང་། རྟ་དང་། རྔ་མོ་དང་། ར་ལུག་དང་། བ་ལང་མང་བ། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་མང་བ།
en: He had many elephants, horses, camels, goats, and cows, and he also possessed many male and female slaves, employees, and day laborers.

source: དབྱིག་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་། དངུལ་མང་བ་ཞིག་གནས་པ་དེ་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་ཏུ་འདུས་ཏེ་འདུག་པར་གྱུར་ཏོ།
en: He also had a great quantity of jewels, gold, gems, pearls, lapis lazuli, conch shells, crystal, coral, fine gold, and silver. In this place, five hundred householders congregated and sat together.

source: །དེ་དག་འདུས་ཏེ་འཁོད་པའི་ཚེ་བར་སྐབས་སུ་འདི་ལྟ་བུའི་གཏམ་རྗོད་དེ།
en: While assembled, they conversed:

source: ཀྱེ་གྲོགས་པོ་དག་སངས་རྒྱས་འབྱུང་བ་རྙེད་པར་དཀའ།
en: “Hey, friends! The appearance of a buddha is rarely met with.

source: མིར་སྐྱེ་བ་རྙེད་པར་དཀའ།
en: A human birth is rarely met with.

source: དལ་བ་ཕུན་སུམ་ཚོགས་པ་རྙེད་པར་དཀའ།
en: The excellent freedoms are rarely met with.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་དད་པ་རྙེད་པར་དཀའ།
en: Faith in the teaching of the Tathāgata is rarely met with.

source: རབ་ཏུ་བྱུང་བ་རྙེད་པར་དཀའ།
en: A renunciate is rarely met with.

source: དགེ་སློང་གི་དངོས་པོ་རྙེད་པར་དཀའ།
en: Monkhood is rarely met with.

source: ནན་ཏན་བྱེད་པ་རྙེད་པར་དཀའ།
en: One who strives earnestly is rarely met with.

source: སེམས་ཅན་གང་དག་བྱས་པ་གཟོ་ཞིང་བྱས་པ་ཤེས་ལ་གང་དག་བྱས་པ་ཆུང་ངུ་ཡང་ཆུད་མི་གཟོན་ན་མང་པོ་ལྟ་ཅི་སྨོས་ཏེ།
en: Some sentient beings have gratitude and understand deeds; they do not squander even small deeds, not to mention extensive ones.

source: དེ་དག་ཆེས་རྙེད་པར་དཀའ།
en: Such people are rarely found.

source: དེ་བས་ཀྱང་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ཡིད་ཆེས་པ་དེ་དག་ཆེས་རྙེད་པར་དཀའ།
en: Even rarer to be found are those sentient beings who have conviction in the teachings of the Tathāgata.

source: དེ་བས་ཀྱང་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ཡིད་ཆེས་ནས་ནན་ཏན་གྱིས་སྒྲུབ་པ་དེ་དག་ཆེས་རྙེད་པར་དཀའ།
en: Still rarer to be found are those sentient beings who, based on their conviction in the teachings of the Tathāgata, earnestly practice them.

source: དེ་བས་ཀྱང་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་མཛེས་པ་དེ་དག་ཆེས་རྙེད་པར་དཀའ།
en: Rarer yet to be found are those sentient beings who are adorned with the teaching of the Tathāgata.

source: འཁོར་བ་ལས་གྲོལ་བ་རྙེད་པར་དཀའ་ན། ཅི་བདག་ཅག་ཉན་ཐོས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའམ། འོན་ཏེ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སམ། འོན་ཏེ་ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱ་ཞེས་འཐུན་པར་འདུས་ཏེ་འཁོད་པ་དེ་དག་ཐམས་ཅད་དེ་ལྟ་བུའི་དཔྱོད་པ་སྐྱེས་ནས་བདག་ཅག་ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱ་བ་ནི་མཆོག་ཡིན་གྱི། ཉན་ཐོས་ཀྱི་ཐེག་པས་ནི་མ་ཡིན། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ནི་མ་ཡིན་ནོ་སྙམ་མོ། །
en: When liberation from saṃsāra is so rarely to be found, will we attain parinirvāṇa through the Śrāvaka Vehicle or the Pratyekabuddha Vehicle, or will we attain it through the unsurpassable Great Vehicle?” Thus, all those harmoniously assembled and seated together, who investigated things in this way considered that the best way to attain parinirvāṇa was not through the Śrāvaka Vehicle or the Pratyekabuddha Vehicle but through the unsurpassable Great Vehicle.

source: དེ་ནས་ཁྱིམ་བདག་དཔས་བྱིན་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་ལྷན་ཅིག་ཏུ་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་ནས་བྱུང་སྟེ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: On this occasion, the householder Vīradatta, surrounded and closely attended by those five hundred householders, proceeded together from the great city of Śrāvastī and went to where the Blessed One was residing in Anāthapiṇḍada’s pleasure garden in Prince Jeta’s Grove.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They prostrated to the feet of the Blessed One and, having circumambulated the Blessed One three times, took their seats to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་བཞིན་དུ་ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then posed the following question to the householder Vīradatta and the five hundred householders, although he already knew the answer:

source: ཁྱིམ་བདག་ཁྱེད་དོན་གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐད་དུ་ལྷགས།
en: “Householders, why have you approached the thus-gone, worthy, complete and perfect Buddha?”

source: དེ་ནས་ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The householder Vīradatta and the five hundred householders arose from their seats, draped their robes over one shoulder, and knelt on their right knee, bowing with palms together.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Vīradatta replied to the Blessed One as follows:

source: །བཅོམ་ལྡན་འདས་དུས་གཅིག་ཅིག་ན། བདག་ཅག་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་གཅིག་ཏུ་འདུས་ཏེ་མཆིས་པར་གྱུར་ནས་དེའི་ཚེ་བདག་ཅག་འདུས་ཏེ་མཆིས་པ་ཐམས་ཅད་བར་སྐབས་སུ་འདི་ལྟ་བུའི་བཀའ་མཆིད་བརྗོད་པ་བྱུང་སྟེ།
en: “Blessed One, at one time I congregated and gathered together with five hundred householders, and at that time all of us who had assembled had the following conversation.

source: སེམས་ཅན་གང་དག་བྱས་པ་གཟོ་ཞིང་བྱས་པ་ཤེས་ལ་གང་དག་བྱས་པ་ཆུང་ངུ་ཡང་ཆུད་མི་གཟོན་ན་མང་པོ་ལྟ་ཅི་སྨོས་ཏེ་དེ་དག་ཆེས་རྙེད་པར་དཀའ།
en: Some sentient beings are grateful and understand deeds; they do not squander even small deeds, not to mention extensive ones. Such people are rarely found.

source: འཁོར་བ་ལས་གྲོལ་བ་རྙེད་པར་དཀའ་ན། ཅི་བདག་ཅག་ཉན་ཐོས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱའམ། འོན་ཏེ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་སམ། འོན་ཏེ་ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱ་ཞེས་བཀའ་མཆིད་བགྱིས་སོ།
en: When liberation from saṃsāra is so rarely to be found, will we attain parinirvāṇa through the Śrāvaka Vehicle or the Pratyekabuddha Vehicle, or will we attain it through the unsurpassable Great Vehicle?’

source: །བཅོམ་ལྡན་འདས་དེའི་ཚེ་བདག་ཅག་ཐམས་ཅད་འདི་ལྟ་བུའི་རྟོག་པ་སྐྱེས་ཏེ།
en: “On that occasion, Blessed One, we all came to the following realization:

source: བདག་ཅག་ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱ་བ་ནི་མཆོག་ལགས་ཀྱི། ཉན་ཐོས་ཀྱི་ཐེག་པས་ནི་མ་ལགས། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་ནི་མ་ལགས་པ་སྙམ་བགྱིད་དེ།
en: we concluded that the best way to attain parinirvāṇa is not through the Śrāvaka Vehicle or the Pratyekabuddha Vehicle but through the unsurpassable Great Vehicle.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཆོས་ཀྱི་སྐྱེས་འདི་དང་ཆས་ཏེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐད་དུ་མཆིས་ན།
en: “Blessed One, we set off with this source of the Dharma and came straight to the thus-gone, worthy, complete and perfect Buddha.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: Blessed One, we are now asking how should a bodhisattva mahāsattva who is seeking to fully awaken to unsurpassable complete and perfect awakening train?

source: བདེ་བར་གཤེགས་པ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: How should one train in it, Sugata?

source: ཇི་ལྟར་གནས་པར་བགྱི།
en: How should one abide by it?

source: ཇི་ལྟར་བསྒྲུབ་པར་བགྱི།
en: How should one proceed with it?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then expressed his approval to the householder Vīradatta and the five hundred householders:

source: ཁྱིམ་བདག་རྣམས་ལེགས་སོ་ལེགས་སོ།
en: “Householders, excellent, excellent!

source: །ཁྱིམ་བདག་རྣམས་ཁྱེད་འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐད་དུ་ལྷགས་པ་ཁྱེད་ཡང་ལེགས་སོ།
en: Householders, having set out for unsurpassable complete and perfect awakening in this way, it is good that you have approached the thus-gone, worthy, complete and perfect Buddha.

source: །ཁྱིམ་བདག་རྣམས་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཇི་ལྟར་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་གནས་པར་བྱ་བ་དང་། ཇི་ལྟར་བསྒྲུབ་པར་བྱ་བ་ངས་ཁྱེད་ལ་བཤད་དོ། །
en: “Therefore, householders, please listen well and bear my words in mind, and I shall explain to you how a bodhisattva, a mahāsattva who is seeking to fully awaken to unsurpassable complete and perfect awakening should train in it, abide by it, and proceed with it.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ། ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “So it shall be, Blessed One,” answered the householder Vīradatta and the five hundred householders, and they began to listen to the Blessed One’s view.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཁྱིམ་བདག་རྣམས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་བསྐྱེད་པར་བྱ། ཀུན་ཏུ་བསྟེན་པར་བྱ།
en: The Blessed One then said to them, “In this regard, householders, the bodhisattva mahāsattva who wishes to fully awaken to unsurpassable complete and perfect awakening should cultivate the spirit of great compassion for all sentient beings. He should be respectful.

source: ངེས་པར་བསྟེན་པར་བྱ།
en: He should stay close to them.

source: བསྒོམ་པར་བྱ།
en: He should cultivate them.

source: མང་དུ་བྱའོ།
en: He should do a lot for them.

source: །ཁྱིམ་བདག་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ལུས་ལ་ཆགས་པར་མི་བྱ།
en: “Householders, such a bodhisattva mahāsattva should not be attached to the body.

source: སྲོག་ལ་ཆགས་པར་མི་བྱ།
en: He should not be attached to life.

source: དེ་བཞིན་དུ་ནོར་དང་། འབྲུ་དང་། ཁྱིམ་དང་། ཆུང་མ་དང་། བུ་དང་། བུ་མོ་རྣམས་ལ་ཆགས་པར་མི་བྱ།
en: Likewise, he should not be attached to wealth, grain, house, wife, sons, or daughters.

source: བཟའ་བ་དང་། བཏུང་བ་དང་། བགོ་བ་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྲེང་བ་རྣམས་ལ་ཆགས་པར་མི་བྱ།
en: He should not be attached to food, drink, clothing, vehicles, bedding, flowers, incense, perfumes, ointments, or garlands.

source: ཡོ་བྱད་ཐམས་ཅད་ལ་ཆགས་པར་མི་བྱའོ།
en: He should not be attached to possessions.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is this?

source: ཁྱིམ་བདག་རྣམས་སེམས་ཅན་དག་ནི་ཕལ་ཆེར་ལུས་དང་སྲོག་ལ་ཆགས་པར་གྱུར་ནས་སྡིག་པའི་ལས་རྣམས་བྱེད་དེ།
en: Householders, it is because sentient beings usually become attached to their body and life and thus commit evil deeds.

source: དེ་དག་སྡིག་པའི་ལས་བྱས་ཤིང་བསགས་པ་དེས་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་བསྐྱེད་དེ།
en: By committing and accumulating this evil karma, they fall headlong into evil states and bad destinies and are reborn as hell beings. Cultivate the spirit of great compassion for all sentient beings.

source: ལུས་དང་སྲོག་ལ་མ་ཆགས་པར་བྱས་ན་བདེ་འགྲོ་རྣམས་སུ་སྐྱེའོ།
en: When one is not attached to the body and not attached to life, one takes birth in the happy destinies.

source: །ཁྱིམ་བདག་རྣམས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་བསྐྱེད་དེ།
en: “For these reasons, householders, a bodhisattva mahāsattva who wishes to fully awaken to unsurpassable complete and perfect awakening should cultivate the spirit of great compassion for all sentient beings.

source: ལུས་ལ་ཆགས་པར་མི་བྱ།
en: He should not be attached to the body.

source: དེ་བཞིན་དུ་ནོར་དང་། འབྲུ་དང་། ཁྱིམ་དང་། ཆུང་མ་དང་། བུ་དང་བུ་མོ་རྣམས་ལ་ཆགས་པར་མི་བྱ།
en: Likewise, he should not be attached to wealth, grain, house, wife, sons, or daughters.

source: བཟའ་བ་དང་། བཏུང་བ་དང་། བགོ་བ་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ལ་ཆགས་པར་མི་བྱ།
en: He should not be attached to food, drink, clothing, vehicles, bedding, flowers, incense, perfumes, garlands, or ointments.

source: ཡོ་བྱད་ཐམས་ཅད་ལ་ཆགས་པར་མི་བྱ།
en: He should not be attached to possessions.

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་ཡོངས་སུ་གཏང་བ་མང་བ་དང་། རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པར་བྱ།
en: “He should renounce extensively and fully, with total renunciation and without expectation for results.

source: ཚུལ་ཁྲིམས་རྣམ་པ་གསུམ་ཡོངས་སུ་དག་པར་ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པ་ལ་གནས་པར་བྱ།
en: He should stand firm in the three aspects of morality, the vows of pure moral discipline.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཉེས་པ་བྱས་པ་ལ་ཇི་མི་སྙམ་པར་བཟོད་པ་དང་དེས་པ་ཕུན་སུམ་ཚོགས་པར་བྱ།
en: He should endure with indifference the negative deeds committed by any sentient being and thus make the most of it.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་ཆེན་པོ་བགོ་བར་བྱ།
en: He should don the great armor of effort in disregarding body and life.

source: རྣམ་པར་མི་གཡེང་བའི་སེམས་ཀྱིས་སེམས་རྩེ་གཅིག་ཏུ་བྱ།
en: He should have one-pointedness of mind with an undistracted mind.

source: བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ལས་སྐྱེས་དང་། ཤེད་བུར་ལྟ་བ་དང་བྲལ་བས་ཤེས་རབ་ཀྱིས་རྣམ་པར་དཔྱད་པ་ལ་མཁས་པར་བྱ།
en: He should become skilled in analysis by means of insight that is free from the view of a self, a being, a life force, a soul, a man, a person, a human-born one, and a human being.

source: དེས་སྦྱིན་པ་སྦྱིན་ན་སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་སྦྱིན་པ་སྦྱིན་པར་བྱ།
en: Therefore, when giving gifts, he should give gifts while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་ཚུལ་ཁྲིམས་བསྲུང་བར་བྱ།
en: He should guard moral discipline while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་བཟོད་པ་བསྒོམ་པར་བྱ།
en: He should cultivate patience while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་བརྩོན་འགྲུས་བརྩམ་པར་བྱ།
en: He should apply effort while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་བསམ་གཏན་ལ་མཉམ་པར་གཞག་པར་བྱ།
en: He should become established in concentration while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་ཤེས་རབ་བསྒོམ་པར་བྱ།
en: He should cultivate wisdom while considering all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ་ཐབས་ལ་མཁས་པ་བསླབ་པར་བྱའོ།
en: He should train in skillful means while considering all sentient beings.”

source: །དེ་ནས་ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་ལུས་ལ་ལྟ་ཞིང་གནས་པ་ལགས། སྲོག་ལ་ལྟ་ཞིང་གནས་པ་ལགས། དེ་བཞིན་དུ་ནོར་དང་། འབྲུ་དང་། ཁྱིམ་དང་། ཆུང་མ་དང་། བུ་དང་། བུ་མོ་རྣམས་ལ་ལྟ་ཞིང་གནས་པ་ལགས། བཟའ་བ་དང་། བཏུང་བ་དང་། བགོ་བ་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། མེ་ཏོག་དང་། སྤོས་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ལ་ལྟ་ཞིང་གནས་པ་ལགས། ཡོ་བྱད་ཐམས་ཅད་ལ་ལྟ་ཞིང་གནས་པ་ལགས་ན།
en: The householder Vīradatta and the five hundred householders then said to the Blessed One, “Blessed One, if one perceives and dwells on the body and life, and likewise perceives and dwells on wealth, grain, house, wife, sons, or daughters, and likewise perceives and dwells on food, drink, clothing, vehicles, bedding, flowers, incense, perfumes, garlands, or ointments, and all one’s enjoyments, then, Blessed One, how should a bodhisattva examine these and thereby disregard the body?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོར་རྟོག་ཅིང་ལུས་ལ་མི་ལྟ་བ་ལགས། བདེ་བར་གཤེགས་པ་ཇི་ལྟར་སྲོག་ལ་མི་ལྟ་བ་ལགས།
en: Tathāgata, how should he disregard life?

source: དེ་བཞིན་དུ་ནོར་དང་། འབྲུ་དང་། ཁྱིམ་དང་། ཆུང་མ་དང་། བུ་དང་། བུ་མོ་རྣམས་ལ་མི་ལྟ་བ་ལགས།
en: Likewise, how should he disregard wealth, grain, house, wife, sons, and daughters?

source: བཟའ་བ་དང་། བཏུང་བ་དང་། བགོ་བ་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ལ་མི་ལྟ་བ་ལགས།
en: How should he disregard food, drink, clothing, vehicles, bedding, flowers, incense, perfumes, garlands, or ointments?

source: ཡོ་བྱད་ཐམས་ཅད་ལ་མི་ལྟ་བ་ལགས།
en: How should he disregard all enjoyments?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དཔས་བྱིན་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཁྱིམ་བདག་རྣམས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལུས་འདི་ལ་རྣམ་པ་དུ་མར་སོ་སོར་བརྟག་པར་བྱའོ། །རྣམ་པ་དུ་མ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་འདི་མཐར་གྱིས་གྲུབ་པ་དང་། མཐར་གྱིས་འཇིག་པ་དང་། རྡུལ་ཕྲ་རབ་བསགས་པ་དང་། ཁོང་སྟོང་དང་། གྱེ་གུ་ཅན་དང་། བུ་ག་དགུ་དང་། སྤུའི་ཁུང་བུ་ནས་ཟག་པ་དང་། གྲོག་མཁར་ལྟར་སྦྲུལ་གདུག་པའི་གནས་སུ་གྱུར་པ་དང་། སྦྲུལ་གདུག་པ་ལྟར་བྱས་པ་མི་གཟོ་བ་དང་། མ་སྐྱེས་དགྲའི་སྤྲེའུ་ལྟར་གྲོགས་ལ་འཁུ་བ་དང་། བཤེས་གཉེན་ངན་པ་ལྟར་འདྲིད་པའི་བདག་ཉིད་ཅན་དང་། དབུ་བ་རྡོས་པ་ལྟར་རང་བཞིན་གྱིས་ཉམ་ཆུང་བ་དང་། ཆུའི་ཆུ་བུར་ལྟར་བྱུང་ནས་འཇིག་ཅིང་འཇུ་བ་དང་། སྨིག་རྒྱུ་ལྟར་སླུ་བའི་བདག་ཉིད་ཅན་དང་། ཆུ་ཤིང་ལྟར་བཤིག་ན་སྙིང་པོ་མེད་པ་དང་། སྒྱུ་མ་ལྟར་སླུ་བའི་བདག་ཉིད་དང་། རྒྱལ་པོ་ལྟར་བགོ་བླག་མང་བ་དང་། དགྲ་ལྟར་གླགས་ལྟ་བ་དང་། རྐུན་པོ་ལྟར་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གཤེད་མ་ལྟར་རྗེས་སུ་ཆགས་པ་མེད་པ་དང་། མི་མཛའ་བ་ལྟར་མི་ཕན་པར་འདོད་པ་དང་། གསོད་པ་ལྟར་ཤེས་རབ་ཀྱི་སྲོག་གི་བར་ཆད་བྱེད་པ་དང་། ཕྱིར་རྒོལ་བ་ལྟར་དགེ་བའི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་བར་ཆད་བྱེད་པ་དང་། གྲོང་སྟོང་ལྟར་བདག་དང་བྲལ་བ་དང་། རྫ་མཁན་གྱི་སྣོད་ལྟར་མཐར་འཇིག་པ་དང་། སྤྱང་ལྟར་མི་གཙང་བ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་། སྦང་མའི་སྣོད་ལྟར་མི་གཙང་བ་ཟག་པ་དང་། སྦྲུལ་དང་། མི་དང་། ཁྱིའི་རོ་ལྟར་དྲི་མི་ཞིམ་པ་དང་། ངན་སྐྱུགས་ཀྱི་ཁུང་བུ་ལྟར་མི་གཙང་བའི་འབྱུང་གནས་དང་། རྨ་ལྟར་བསྐྱོད་མི་བཟོད་པ་དང་། ཟུག་རྔུ་ལྟར་གནོད་པའི་བདག་ཉིད་ཅན་དང་། རྗེ་བོ་སྡང་བ་ལྟར་བསྙེན་པར་དཀའ་བ་དང་། ཁང་རྙིང་ལྟར་བཅོས་ལེགས་བྱ་ཞིང་བསྟེན་པ་དང་། གྲུ་རྙིང་ལྟར་བཅོས་ལེགས་བྱ་ཞིང་སྤྱད་པ་དང་། བུམ་པ་སོ་མ་བཏང་བ་ལྟར་ནན་ཏན་གྱིས་བག་བྱ་དགོས་པ་དང་། གྲོགས་པོ་མི་སྲུན་པ་ལྟར་རྟག་ཏུ་རྗེས་སུ་བསྲུང་དགོས་པ་དང་། ཆུ་འགྲམ་གྱི་ཤིང་ལྟར་གཡོ་ཞིང་འགུལ་བ་དང་། ཆུ་ཀླུང་ཆེན་པོའི་རྒྱུན་ལྟར་མཐར་མཆི་བའི་རྒྱ་མཚོ་ལ་ཐུག་པ་དང་། བློ་བུར་བའི་ཁྱིམ་ལྟར་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱི་གནས་སུ་གྱུར་པ་དང་། མགྲོན་པོ་མེད་པའི་གནས་ཁང་ལྟར་ཡོངས་སུ་གཟུང་བ་མེད་པ་དང་། བཙོན་སྲུངས་ལྟར་གསུག་གིས་བསྒྲུབ་པར་བྱ་བ་དང་། མཐའ་འཁོབ་ཀྱི་གྲོང་ཁྱེར་ལྟར་རྟག་ཏུ་གནོད་པ་འབྱུང་བ་དང་། བྱེ་མའི་གྲོང་ཁྱེར་ལྟར་རྟག་ཏུ་འཇིག་པའི་བདག་ཉིད་ཅན་དང་། མེ་ལྟར་ཆོག་མི་ཤེས་པ་དང་། རྒྱ་མཚོ་ལྟར་དགང་དཀའ་བ་དང་། སྦྲུལ་གྱི་གཟེབ་ལྟར་ནན་ཏན་གྱིས་བག་བྱ་བ་དང་། བྱིས་པ་ཆུང་ངུ་ལྟར་རྟག་ཏུ་ཡོངས་སུ་བསྐྱང་དགོས་པ་དང་། སྣོད་ཆག་པ་ལྟར་རྟག་ཏུ་བག་བྱ་དགོས་པ་དང་། ཡུལ་ངན་པ་ལྟར་རྟག་ཏུ་གནོད་པ་འབྱུང་བ་དང་། ཟས་དུག་ཅན་ལྟར་རྟག་ཏུ་ཡོངས་སུ་སྤང་བར་བྱ་བ་དང་། རེ་ཤིག་དགོས་པའི་ཕྱིར་སྣོད་བརྙན་མ་ལྟ་བུ་དང་། ཁུར་བཀུར་བའི་ཕྱིར་ཤིང་རྟ་ལྟ་བུ་ཡིན་པ་འབའ་ཞིག་བློས་གཟུང་བར་བྱའོ།
en: The Blessed One said to the householder Vīradatta and the five hundred householders, “In this regard, householders, the bodhisattva mahāsattva should examine multiple aspects of this body. What are the multiple aspects? They consist in this body’s gradual development and gradual deterioration, its being a collection of minute particles, its hollow interior, its crookedness, and its contamination through the nine crevices and the hair pores. Like an anthill, it serves as a den for poisonous snakes. As with a poisonous snake, people avoid dealing with it. Like the monkey of Ajātaśatru, it is hostile to friends. Like a wicked friend, it is the embodiment of deceit. Like a mass of foam, it is vacuous by nature. Like a water bubble, it breaks when grasped. Like a mirage, it is the embodiment of deception. Like a plantain, it lacks any core when split apart. “Like an illusion, it is the embodiment of deceptiveness. Like a king, it is pampered a lot. Like an enemy, it looks for opportunities. Like a thief, it cannot be trusted. Like an executioner, it is without any affection. Like a foe, it wants to be unbeneficial. Like a murderer, it hinders the life force of insight. Like hostile forces, it hinders qualities conducive to virtue. Like a ghost town, it is devoid of self. Like a potter’s vase, it will eventually disintegrate. Like a mire, it is filled with all sorts of filth. Like a mug of malt dregs, it is contaminated with impurities. Like the corpse of a snake, man, or dog, it has an unpleasant smell. Like a puddle of vomit, it is a source of filth. Like a wound, it is unbearable when disturbed. Like a thorn, it has the nature of piercing. Like an indignant ruler, it is difficult to appease. Like an old house, it needs attention and proper repairs. Like an old boat, it needs upkeep and proper repairs. Like a freshly made clay pot, it needs to be handled carefully. As with a mischievous friend, one must always be on guard against it. “Like a tree on a riverbank, it is unstable. Like the stream of a great river, it ends in the ocean of death. Like a house of drifters, it is the haven of all miseries. Like a hotel without guests, it is unidentifiable. Like a jailer, it is susceptible to bribes. Like a town in savage border lands, it presents a constant threat. Like a city made of sand, it is always deteriorating. Like a fire, it is insatiable. Like the ocean, it is hard to fill up. Like a basket containing a viper, it has to be handled carefully. Like a young child, it needs constant protection. Like a broken vessel, it needs constant attention. Like a famine, it brings constant misfortune. Like poison food, it must always be purged. It is like a borrowed vessel because its purpose is temporary. It is like a cart because it bears a burden.

source: །ཁྱིམ་བདག་རྣམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་ལུས་འདི་ཐོག་མ་དང་ཐ་མའི་རྒྱུ་ལ་སོ་སོར་བརྟག་པར་བྱའོ།
en: One should apprehend the body intellectually as nothing more than these things. “Moreover, householders, a bodhisattva should examine this body according to the initial and final causes.

source: །ཕ་མའི་ཁུ་ཆུ་དང་ཁྲག་འདུས་པ་ལས་འབྱུང་སྟེ། འདི་ལ་ཁུ་ཆུ་དང་ཁྲག་ནི་ལུས་ཀྱི་ཐོག་མའི་རྒྱུ་ཡིན་ནོ།
en: The initial cause of the body is its genesis from the combination of the seminal fluid and blood of one’s father and mother.
